vertical-pod-autoscaler/experiments/sn-pbr-throughput/6plus/home.log
Running 15m test @ http://10.104.67.244:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 4.318ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 4.466ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    74.31ms   70.71ms 321.28ms   83.97%
    Req/Sec    30.78     46.06   153.00     93.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   53.02ms
 75.000%   99.39ms
 90.000%  161.02ms
 99.000%  321.28ms
 99.900%  565.25ms
 99.990%    1.05s 
 99.999%    1.07s 
100.000%    1.14s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.180     0.000000            1         1.00
      16.015     0.100000         5323         1.11
      23.935     0.200000        10644         1.25
      31.103     0.300000        15966         1.43
      40.703     0.400000        21298         1.67
      53.023     0.500000        26607         2.00
      60.159     0.550000        29263         2.22
      68.223     0.600000        31926         2.50
      77.119     0.650000        34598         2.86
      87.359     0.700000        37240         3.33
      99.391     0.750000        39900         4.00
     106.495     0.775000        41231         4.44
     114.815     0.800000        42562         5.00
     123.519     0.825000        43894         5.71
     133.759     0.850000        45234         6.67
     146.175     0.875000        46558         8.00
     153.343     0.887500        47227         8.89
     161.023     0.900000        47883        10.00
     170.111     0.912500        48544        11.43
     181.119     0.925000        49212        13.33
     192.895     0.937500        49875        16.00
     199.935     0.943750        50206        17.78
     207.871     0.950000        50540        20.00
     216.575     0.956250        50875        22.86
     225.663     0.962500        51204        26.67
     237.951     0.968750        51539        32.00
     244.607     0.971875        51702        35.56
     253.183     0.975000        51869        40.00
     262.911     0.978125        52035        45.71
     274.687     0.981250        52202        53.33
     288.767     0.984375        52371        64.00
     295.167     0.985938        52453        71.11
     303.359     0.987500        52534        80.00
     315.135     0.989062        52617        91.43
     326.911     0.990625        52700       106.67
     341.247     0.992188        52783       128.00
     348.927     0.992969        52824       142.22
     359.167     0.993750        52866       160.00
     369.663     0.994531        52909       182.86
     382.719     0.995313        52949       213.33
     398.591     0.996094        52991       256.00
     405.503     0.996484        53011       284.44
     412.159     0.996875        53032       320.00
     424.447     0.997266        53053       365.71
     439.039     0.997656        53074       426.67
     460.543     0.998047        53095       512.00
     477.183     0.998242        53105       568.89
     496.383     0.998437        53115       640.00
     514.815     0.998633        53126       731.43
     537.087     0.998828        53136       853.33
     575.487     0.999023        53147      1024.00
     613.887     0.999121        53152      1137.78
     638.975     0.999219        53157      1280.00
     710.143     0.999316        53162      1462.86
     774.143     0.999414        53167      1706.67
     875.519     0.999512        53173      2048.00
     895.999     0.999561        53175      2275.56
     922.623     0.999609        53178      2560.00
     943.615     0.999658        53181      2925.71
     946.687     0.999707        53183      3413.33
    1002.495     0.999756        53186      4096.00
    1012.223     0.999780        53187      4551.11
    1014.783     0.999805        53188      5120.00
    1020.927     0.999829        53189      5851.43
    1036.799     0.999854        53191      6826.67
    1050.623     0.999878        53192      8192.00
    1052.671     0.999890        53193      9102.22
    1052.671     0.999902        53193     10240.00
    1053.695     0.999915        53194     11702.86
    1067.007     0.999927        53195     13653.33
    1067.007     0.999939        53195     16384.00
    1069.055     0.999945        53196     18204.44
    1069.055     0.999951        53196     20480.00
    1069.055     0.999957        53196     23405.71
    1071.103     0.999963        53197     27306.67
    1071.103     0.999969        53197     32768.00
    1071.103     0.999973        53197     36408.89
    1071.103     0.999976        53197     40960.00
    1071.103     0.999979        53197     46811.43
    1138.687     0.999982        53198     54613.33
    1138.687     1.000000        53198          inf
#[Mean    =       74.314, StdDeviation   =       70.711]
#[Max     =     1137.664, Total count    =        53198]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  53852 requests in 15.00m, 460.20MB read
  Socket errors: connect 0, read 0, write 9, timeout 0
Requests/sec:     59.83
Transfer/sec:    523.58KB